In [145]:
import pandas as pd
import numpy as np

In [146]:
df1 = pd.DataFrame({
    'key' : ['a', 'b', 'c', 'd', 'e'],
    'A1' : range(5),
    'B1' : range(5, 10),
})

df2 = pd.DataFrame({
    'key' : ['a', 'b', 'c'],
    'A2' : range(3),
    'B2' : range(3, 6),
})

In [147]:
df1

  key  A1  B1
0   a   0   5
1   b   1   6
2   c   2   7
3   d   3   8
4   e   4   9

In [148]:
df2

  key  A2  B2
0   a   0   3
1   b   1   4
2   c   2   5

In [149]:
pd.merge(df1, df2, how='left', on='key')

  key  A1  B1   A2   B2
0   a   0   5  0.0  3.0
1   b   1   6  1.0  4.0
2   c   2   7  2.0  5.0
3   d   3   8  NaN  NaN
4   e   4   9  NaN  NaN

In [150]:
# 4 Type of marge
# left, right, inner, Outer=Full join

In [151]:
pd.merge(df1, df2, how='right', on='key')

  key  A1  B1  A2  B2
0   a   0   5   0   3
1   b   1   6   1   4
2   c   2   7   2   5

In [152]:
pd.merge(df1, df2, how='left', on='key')[['A1', 'A2']]

   A1   A2
0   0  0.0
1   1  1.0
2   2  2.0
3   3  NaN
4   4  NaN

In [153]:
pd.merge(df1, df2, how='right', on='key')

  key  A1  B1  A2  B2
0   a   0   5   0   3
1   b   1   6   1   4
2   c   2   7   2   5

In [154]:
pd.merge(df1, df2, how= 'outer', on='key')

  key  A1  B1   A2   B2
0   a   0   5  0.0  3.0
1   b   1   6  1.0  4.0
2   c   2   7  2.0  5.0
3   d   3   8  NaN  NaN
4   e   4   9  NaN  NaN

### Marging Two table using two pk

In [155]:
left = pd.DataFrame({
    'key1' : ['a', 'a', 'b', 'c'],
    'key2' : ['a', 'b', 'a', 'b'],
    'A' : ['A0', 'A1', 'A2', 'A3'],
    'B' : ['B0', 'B1', 'B2', 'B3']
})

right = pd.DataFrame({
    'key1' : ['a', 'b', 'b', 'c'],
    'key2' : ['a', 'b', 'a', 'a'],
    'C' : ['C0', 'C1', 'C2', 'C3'],
    'D' : ['D0', 'D1', 'D2', 'D3']
})

In [156]:
left

  key1 key2   A   B
0    a    a  A0  B0
1    a    b  A1  B1
2    b    a  A2  B2
3    c    b  A3  B3

In [157]:
right

  key1 key2   C   D
0    a    a  C0  D0
1    b    b  C1  D1
2    b    a  C2  D2
3    c    a  C3  D3

In [158]:
pd.merge(left, right, how='inner', on=['key1', 'key2'])

  key1 key2   A   B   C   D
0    a    a  A0  B0  C0  D0
1    b    a  A2  B2  C2  D2

In [159]:
pd.merge(left, right, how='outer', on=['key1', 'key2'])

  key1 key2    A    B    C    D
0    a    a   A0   B0   C0   D0
1    a    b   A1   B1  NaN  NaN
2    b    a   A2   B2   C2   D2
3    c    b   A3   B3  NaN  NaN
4    b    b  NaN  NaN   C1   D1
5    c    a  NaN  NaN   C3   D3

In [160]:
pd.merge(left, right, how='left', on=['key1', 'key2'])

  key1 key2   A   B    C    D
0    a    a  A0  B0   C0   D0
1    a    b  A1  B1  NaN  NaN
2    b    a  A2  B2   C2   D2
3    c    b  A3  B3  NaN  NaN

In [161]:
pd.merge(left, right, how='right', on=['key1', 'key2'])

  key1 key2    A    B   C   D
0    a    a   A0   B0  C0  D0
1    b    b  NaN  NaN  C1  D1
2    b    a   A2   B2  C2  D2
3    c    a  NaN  NaN  C3  D3

 ## Handling Missing Data

In [162]:
data_dic = {'A':[1,2,np.nan,4,np.nan],
            'B':[np.nan,np.nan,np.nan,np.nan,np.nan],
            'C':[11,12,13,14,15],
            'D':[16,np.nan,18,19,20]}
df = pd.DataFrame(data_dic) 
df

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [163]:
df.isnull()

       A     B      C      D
0  False  True  False  False
1  False  True  False   True
2   True  True  False  False
3  False  True  False  False
4   True  True  False  False

In [164]:
df.isnull().sum()

A    2
B    5
C    0
D    1
dtype: int64

In [165]:
df.isnull().sum().sum()

8

In [166]:
df['A'].isnull().sum()

2

In [167]:
df.loc[1].isnull()

A    False
B     True
C    False
D     True
Name: 1, dtype: bool

In [168]:
df.loc[1].isnull().sum()

2

In [169]:
df.shape

(5, 4)

In [170]:
df

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [171]:
df['A'].sum()

7.0

In [172]:
df.loc[1].sum()

14.0

In [173]:
df.dropna(axis=0)

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [174]:
df

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [175]:
df.dropna(axis=1) # all data is not removing because we isn't add inplace=True

    C
0  11
1  12
2  13
3  14
4  15

In [176]:
df

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [177]:
df.dropna(thresh=3, axis=1)

     A   C     D
0  1.0  11  16.0
1  2.0  12   NaN
2  NaN  13  18.0
3  4.0  14  19.0
4  NaN  15  20.0

In [178]:
df.dropna(thresh=4, axis=1)

    C     D
0  11  16.0
1  12   NaN
2  13  18.0
3  14  19.0
4  15  20.0

In [179]:
df

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [180]:
df['A'].fillna(value= df['A'].mean())

0    1.000000
1    2.000000
2    2.333333
3    4.000000
4    2.333333
Name: A, dtype: float64

In [181]:
df

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [182]:
df.fillna(method='ffill')

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12  16.0
2  2.0 NaN  13  18.0
3  4.0 NaN  14  19.0
4  4.0 NaN  15  20.0

In [183]:
df.fillna(0)

     A    B   C     D
0  1.0  0.0  11  16.0
1  2.0  0.0  12   0.0
2  0.0  0.0  13  18.0
3  4.0  0.0  14  19.0
4  0.0  0.0  15  20.0

In [184]:
df

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [185]:
df.fillna(method='bfill')

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12  18.0
2  4.0 NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [186]:
from sklearn.impute import SimpleImputer

In [195]:
df2 = df.copy()

In [196]:
df2

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [197]:
imputer = SimpleImputer(strategy='constant', fill_value= -1)
df2['A'] = imputer.fit_transform(df2[['A']])
df2

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2 -1.0 NaN  13  18.0
3  4.0 NaN  14  19.0
4 -1.0 NaN  15  20.0

In [198]:
df2

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2 -1.0 NaN  13  18.0
3  4.0 NaN  14  19.0
4 -1.0 NaN  15  20.0

In [203]:
df2 = df.copy()
impu = SimpleImputer(strategy='mean')

In [204]:
df2['A'] = impu.fit_transform(df2[['A']])

In [205]:
df2

          A   B   C     D
0  1.000000 NaN  11  16.0
1  2.000000 NaN  12   NaN
2  2.333333 NaN  13  18.0
3  4.000000 NaN  14  19.0
4  2.333333 NaN  15  20.0

In [206]:
data_dic = {'A':[1,2,np.nan,4,np.nan],
            'B':[np.nan,np.nan,np.nan,np.nan,np.nan],
            'C':[11,12,13,14,15],
            'D':[16,np.nan,18,19,18]}
df2 = pd.DataFrame(data_dic) 
df2

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  18.0

In [207]:
imputer = SimpleImputer(strategy='most_frequent')
df2['D'] = imputer.fit_transform(df[['D']])
df2

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12  16.0
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [208]:
from sklearn.impute import KNNImputer

In [209]:
knn_imputer = KNNImputer(n_neighbors=2, weights="uniform")

In [210]:
df2 = knn_imputer.fit_transform(df2)
df2

array([[ 1., 11., 16.],
       [ 2., 12., 16.],
       [ 3., 13., 18.],
       [ 4., 14., 19.],
       [ 3., 15., 20.]])

### Usefull Methods

In [212]:
import numpy as np
import pandas as pd
data_dic = {'col_1':[1,2,3,4,5],
           'col_2':[111,222,333,111,555],
           'col_3':['alpha','bravo','charlie',np.nan,np.nan],
           }
df = pd.DataFrame(data_dic)
df

   col_1  col_2    col_3
0      1    111    alpha
1      2    222    bravo
2      3    333  charlie
3      4    111      NaN
4      5    555      NaN

In [213]:
df['col_2'].unique()

array([111, 222, 333, 555])

In [214]:
df.nunique()

col_1    5
col_2    4
col_3    3
dtype: int64

In [216]:
df['col_1'].nunique()

5

In [217]:
df

   col_1  col_2    col_3
0      1    111    alpha
1      2    222    bravo
2      3    333  charlie
3      4    111      NaN
4      5    555      NaN

In [218]:
df['col_2'].value_counts()

col_2
111    2
222    1
333    1
555    1
Name: count, dtype: int64

In [223]:
df.count()

col_1    5
col_2    5
col_3    3
dtype: int64

In [222]:
df.value_counts()

col_1  col_2  col_3
1      111    alpha      1
2      222    bravo      1
3      333    charlie    1
Name: count, dtype: int64

In [221]:
df.sort_values(by='col_3', ascending=False)

   col_1  col_2    col_3
2      3    333  charlie
1      2    222    bravo
0      1    111    alpha
3      4    111      NaN
4      5    555      NaN

In [224]:
## apply

In [225]:
def squere(value):
    return value*value

In [227]:
df['col_1'].apply(squere)

0     1
1     4
2     9
3    16
4    25
Name: col_1, dtype: int64

In [228]:
df.columns

Index(['col_1', 'col_2', 'col_3'], dtype='object')